backend_appa_shop/app/controllers/api/v1/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2  [["uid", "103179360828016946659"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "uid") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        #coming from omniauth flow
      if request.env['omniauth.auth']
        @googleUser = request.env['omniauth.auth']

        @user = User.find_by(uid: @googleUser.uid)

        if @user
          token = encode_token({ user_id: @user.id })
          render json: { user: UserSerializer.new(@user), jwt: token }, status: :accepted
        else
          @user = User.create(email: @googleUser.info.email, password: BCrypt::Password.create(('a'..'z').to_a.shuffle[0,8].join), uid: @googleUser.uid)